In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
df = pd.DataFrame(randn(4,3),["A","B","C","D"],["Column1","Column2","Column3"])

In [3]:
df

    Column1   Column2   Column3
A  1.201322 -1.240382 -0.524557
B  2.018686 -0.809915 -1.407355
C  1.362349  1.100202  1.203840
D  0.211224 -0.270672 -1.031963

In [4]:
df > -1

   Column1  Column2  Column3
A     True    False     True
B     True     True    False
C     True     True     True
D     True     True    False

In [5]:
df > 0

   Column1  Column2  Column3
A     True    False    False
B     True    False    False
C     True     True     True
D     True    False    False

In [6]:
booleanDf = df > 0

In [7]:
booleanDf

   Column1  Column2  Column3
A     True    False    False
B     True    False    False
C     True     True     True
D     True    False    False

In [8]:
df[booleanDf]

    Column1   Column2  Column3
A  1.201322       NaN      NaN
B  2.018686       NaN      NaN
C  1.362349  1.100202  1.20384
D  0.211224       NaN      NaN

In [9]:
df[ df > 0]

    Column1   Column2  Column3
A  1.201322       NaN      NaN
B  2.018686       NaN      NaN
C  1.362349  1.100202  1.20384
D  0.211224       NaN      NaN

In [10]:
df

    Column1   Column2   Column3
A  1.201322 -1.240382 -0.524557
B  2.018686 -0.809915 -1.407355
C  1.362349  1.100202  1.203840
D  0.211224 -0.270672 -1.031963

In [11]:
df["Column1"]

A    1.201322
B    2.018686
C    1.362349
D    0.211224
Name: Column1, dtype: float64

In [12]:
df["Column1"] > 0

A    True
B    True
C    True
D    True
Name: Column1, dtype: bool

In [15]:
df[df["Column1"]>1]

    Column1   Column2   Column3
A  1.201322 -1.240382 -0.524557
B  2.018686 -0.809915 -1.407355
C  1.362349  1.100202  1.203840

In [16]:
df["Column1"] > 1

A     True
B     True
C     True
D    False
Name: Column1, dtype: bool

In [17]:
df

    Column1   Column2   Column3
A  1.201322 -1.240382 -0.524557
B  2.018686 -0.809915 -1.407355
C  1.362349  1.100202  1.203840
D  0.211224 -0.270672 -1.031963

In [18]:
df[df["Column2"]> 1]

    Column1   Column2  Column3
C  1.362349  1.100202  1.20384

In [19]:
df[(df["Column1"]> 1) & (df["Column2"]> 1) ]

    Column1   Column2  Column3
C  1.362349  1.100202  1.20384

In [20]:
df[(df["Column1"]> 1) | (df["Column2"]> 1)]

    Column1   Column2   Column3
A  1.201322 -1.240382 -0.524557
B  2.018686 -0.809915 -1.407355
C  1.362349  1.100202  1.203840

In [21]:
df

    Column1   Column2   Column3
A  1.201322 -1.240382 -0.524557
B  2.018686 -0.809915 -1.407355
C  1.362349  1.100202  1.203840
D  0.211224 -0.270672 -1.031963

In [22]:
df["Column4"] = pd.Series(randn(4),["A","B","C","D"])

In [24]:
df

    Column1   Column2   Column3   Column4
A  1.201322 -1.240382 -0.524557 -0.464258
B  2.018686 -0.809915 -1.407355  2.456147
C  1.362349  1.100202  1.203840  0.148764
D  0.211224 -0.270672 -1.031963 -0.548775

In [25]:
df["Column5"] = randn(4)

In [26]:
df

    Column1   Column2   Column3   Column4   Column5
A  1.201322 -1.240382 -0.524557 -0.464258  0.547996
B  2.018686 -0.809915 -1.407355  2.456147  0.057294
C  1.362349  1.100202  1.203840  0.148764 -0.213625
D  0.211224 -0.270672 -1.031963 -0.548775  1.141542

In [27]:
df["Column6"] = ["newValue1","newValue2","newValue3","newValue4"]

In [28]:
df

    Column1   Column2   Column3   Column4   Column5    Column6
A  1.201322 -1.240382 -0.524557 -0.464258  0.547996  newValue1
B  2.018686 -0.809915 -1.407355  2.456147  0.057294  newValue2
C  1.362349  1.100202  1.203840  0.148764 -0.213625  newValue3
D  0.211224 -0.270672 -1.031963 -0.548775  1.141542  newValue4

In [31]:
df.set_index("Column6",inplace = True)

In [32]:
df

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1  1.201322 -1.240382 -0.524557 -0.464258  0.547996
newValue2  2.018686 -0.809915 -1.407355  2.456147  0.057294
newValue3  1.362349  1.100202  1.203840  0.148764 -0.213625
newValue4  0.211224 -0.270672 -1.031963 -0.548775  1.141542

In [33]:
df.index.names

FrozenList(['Column6'])